week_1/quiz_1.tex
% Created 2024-07-13 Sat 18:15
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[a4paper,left=1cm,right=1cm,top=1cm,bottom=1cm]{geometry}
\usepackage[american, english]{babel}
\usepackage{enumitem}
\usepackage{float}
\usepackage[sc]{mathpazo}
\linespread{1.05}
\renewcommand{\labelitemi}{$\rhd$}
\setlength\parindent{0pt}
\setlist[itemize]{leftmargin=*}
\setlist{nosep}
\date{}
\title{Take Care of Your Competitors}
\hypersetup{
 pdfauthor={Marcio Woitek},
 pdftitle={Take Care of Your Competitors},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 29.4 (Org mode 9.8)}, 
 pdflang={English}}
\begin{document}

\thispagestyle{empty}
\pagestyle{empty}
\section*{Problem 1}
\label{sec:org6466e48}

\textbf{Answer:} No\\

Assume a Nash equilibrium with dominated strategies does exist. Then at least
one player selected a dominated strategy. By definition, this is the worst
strategy he could have selected. Consequently, this player has at least one
option that leads to a higher payoff. By switching to this strategy, he can
deviate from the Nash equilibrium and obtain a better outcome. However, this
should not be possible. Therefore, our assumption must be wrong. We have just
concluded that a Nash equilibrium with dominated strategies cannot exist.
\section*{Problem 2}
\label{sec:org3e4b0d4}

\textbf{Answer:} Yes\\

Clearly, opting for the product placement leads to the highest payoff for Mars.
\section*{Problem 3}
\label{sec:org5be0b16}

\textbf{Answer:} Yes\\

An example of a game with more than one Nash equilibrium is the Coordination
Game.
\section*{Problem 4}
\label{sec:org8f10b12}

\textbf{Answer:} Low Price\\

In this case, City Cuts corresponds to Player 1, and Toby's Hairstyle
corresponds to Player 2. Consider the best reply by Player 1 for each strategy
of Player 2:
\begin{itemize}
\item Player 2 chooses High Price: Player 1 chooses Low Price;
\item Player 2 chooses Low Price: Player 1 chooses High Price.
\end{itemize}
Next, consider the best reply by Player 2 for each strategy of Player 1:
\begin{itemize}
\item Player 1 chooses High Price: Player 2 chooses High Price;
\item Player 1 chooses Low Price: Player 2 chooses High Price.
\end{itemize}
For Player 2, choosing High Price is always the best strategy. If we assume that
this player is rational, then this is the option he'll choose. In this case, the
best reply by Player 1 is selecting Low Price. Notice that this situation
corresponds to a Nash equilibrium.
\section*{Problem 5}
\label{sec:org3917fc6}

\textbf{Answer:} matrix
\section*{Problem 6}
\label{sec:orgbb66c9e}

\textbf{Answer:} 0\\

This game was discussed in one of the lectures. As explained, in this case there
is no Nash equilibrium. Essentially, the idea is that the best strategy for one
player leaves the worst strategy as the only option for the other player.
\section*{Problem 7}
\label{sec:org84bb9a9}

\textbf{Answer:} \(2<x<5\)\\

First recall that, for a game to be a prisoner's dilemma, the following must
hold:
\begin{itemize}
\item non-cooperation is the best strategy for each player;
\item mutual cooperation is superior to mutual non-cooperation.
\end{itemize}
With that in mind, let us analyze this game's payoff table. We begin by
identifying the best reply by Player 1 for each strategy of Player 2:
\begin{itemize}
\item Player 2 chooses Advertise: Player 1 chooses Do not advertise;
\item Player 2 chooses Do not advertise: Player 1 chooses Do not advertise.
\end{itemize}
Hence the option not to advertise is always the best strategy for Player 1. We
want this to also be true for Player 2. So consider the best reply by this
player for each strategy of Player 1:
\begin{itemize}
\item Player 1 chooses Advertise: Player 2 chooses Do not advertise;
\item Player 1 chooses Do not advertise:
\begin{itemize}
\item Player 2 chooses Advertise if \(x<2\);
\item Player 2 chooses Do not advertise if \(x>2\).
\end{itemize}
\end{itemize}
Therefore, the requirement that non-cooperation is the best option for each
player allows us to conclude that \(x>2\). Moreover, since mutual cooperation
has to be superior to mutual non-cooperation, the inequality \(x<5\) needs to
be satisfied. Hence: \(2<x<5\).
\section*{Problem 8}
\label{sec:orgda7b15c}

\textbf{Answer:} A player's plan of actions in a game.
\section*{Problem 9}
\label{sec:org52bea79}

\textbf{Answer:} Yes\\

Imagine Lufthansa enters the market. If British Airways doesn't start a price
war, then its payoff is 200. On the other hand, if this company starts a price
war, then its payoff is 300. Since this value is higher, British Airways has an
incentive to start a price war if Lufthansa enters the UK market. Therefore, the
threat is credible.
\section*{Problem 10}
\label{sec:orgc0bba98}

\textbf{Answer:} Sensodyne - Do not advertise\\

Consider the possible replies by Player 1 for each strategy of Player 2:
\begin{itemize}
\item Player 2 chooses Advertise:
\begin{itemize}
\item Advertise is the best action;
\item Do not advertise is the worst action.
\end{itemize}
\item Player 2 chooses Do not advertise:
\begin{itemize}
\item Advertise is the best action;
\item Do not advertise is the worst action.
\end{itemize}
\end{itemize}
Therefore, for Player 1, Do not advertise is a dominated strategy.\\
Next, consider the possible replies by Player 2 for each strategy of Player 1:
\begin{itemize}
\item Player 1 chooses Advertise:
\begin{itemize}
\item Advertise is the best action;
\item Do not advertise is the worst action.
\end{itemize}
\item Player 1 chooses Do not advertise:
\begin{itemize}
\item Do not advertise is the best action;
\item Advertise is the worst action.
\end{itemize}
\end{itemize}
Then, for Player 2, there is no dominated strategy. Consequently, the only
correct answer is ``Sensodyne - Do not advertise''.
\end{document}
